n,k = map(int,input().split())
dp=[[0]*(k+1) for _ in range(n+1)]
dp[0][0]=1
for i in range(0,n+1):
    for j in range(1,k+1):
         #ex)n=5 k=3, 앞이 0이고 뒤에 2개의 숫자로 5를 만드는 [5][2]
         #앞이 1이고 뒤에 2개의 숫자로 4를 만드는 [4][2]
         #따라서 [5][3]=[5][2]+[4][2]+[3][2]+[2][2]+[1][2]+[0][2]
         # [n][k]=[n][k-1]+[n-1][k-1]+[n-2][k-1]+...+[0][k-1]
         # 이때 [n-1][k]=[n-1][k-1]+[n-2][k-1]+...+[0][k-1] 이므로
         # [n][k]=[n][k-1]+[n-1][k] 점화식 생성
         dp[i][j]=dp[i-1][j]+dp[i][j-1]
print(dp[n][k]%1000000000)
