import sys
t = int(sys.stdin.readline().rstrip())
dp=[[0 for _ in range(3)] for _ in range(100001)]
#[1로끝나는갯수,2로끝나는갯수,3끝나는갯수]
dp[1]=[1,0,0] #숫자1은 1 하나이므로 1,0,0
dp[2]=[0,1,0] #숫자2는 2 하나이므로 0,1,0
dp[3]=[1,1,1] #숫자3은 1+2,2+1,3 이므로 1,1,1
for i in range(4,100001):
    #i=6이면 dp[6][0]은 i=5일때 2,3로 끝나는 갯수를 더한 값과 같음(뒤에 1만 붙이면 됌)
    dp[i][0]=(dp[i-1][1]+dp[i-1][2])%1000000009
    #dp[6][1]은 2로 끝난 갯수이므로 i=4일때 1,3로 끝나는 갯수를 더한 값과 같음(뒤에 2만 붙이면 됌)
    dp[i][1]=(dp[i-2][0]+dp[i-2][2])%1000000009
    #dp[6][2]은 3으로 끝난 갯수이므로 i=3일때 1,2로 끝나는 갯수를 더한 값과 같음(뒤에 3만 붙이면 됌)
    dp[i][2]=(dp[i-3][0]+dp[i-3][1])%1000000009

for _ in range(t):
    n=int(sys.stdin.readline().rstrip())
    print(sum(dp[n])%1000000009)
    
    


